/*
	ファイル名：.cpp
	　　　概要：を管理するクラス
*/
#include "pch.h"
#include "ChargePunch.h"
#include "WorkTool/DeviceResources.h"
#include "WorkTool/Graphics.h"
#include "WorkTool/Resources.h"
#include "WorkTool/Data.h"
#include "WorkTool/InputDevice.h"

//---------------------------------------------------------
// コンストラクタ
//---------------------------------------------------------
ChargePunch::ChargePunch()
{
	
}

//---------------------------------------------------------
// デストラクタ
//---------------------------------------------------------
ChargePunch::~ChargePunch()
{

}

//---------------------------------------------------------
// 初期化する
//---------------------------------------------------------
void ChargePunch::Initialize()
{
	
}

//---------------------------------------------------------
// 更新する
//---------------------------------------------------------
void ChargePunch::Update(float elapsedTime)
{	
	
}

//---------------------------------------------------------
// 描画する
//---------------------------------------------------------
void ChargePunch::Render()
{
	
}

//---------------------------------------------------------
// 後始末する
//---------------------------------------------------------
void ChargePunch::Finalize()
{

}