/*
	ファイル名：.cpp
	　　　概要：を管理するクラス
*/
#include "pch.h"
#include "DownEffect.h"
#include "FrameWork/DeviceResources.h"
#include "FrameWork/Graphics.h"
#include "FrameWork/Resources.h"
#include "FrameWork/Data.h"
#include "FrameWork/InputDevice.h"

//---------------------------------------------------------
// コンストラクタ
//---------------------------------------------------------
DownEffect::DownEffect()
{
	
}

//---------------------------------------------------------
// デストラクタ
//---------------------------------------------------------
DownEffect::~DownEffect()
{

}

//---------------------------------------------------------
// 初期化する
//---------------------------------------------------------
void DownEffect::Initialize()
{
	
}

//---------------------------------------------------------
// 更新する
//---------------------------------------------------------
void DownEffect::Update(float elapsedTime)
{	
	
}

//---------------------------------------------------------
// 描画する
//---------------------------------------------------------
void DownEffect::Render()
{
	
}

//---------------------------------------------------------
// 後始末する
//---------------------------------------------------------
void DownEffect::Finalize()
{

}